From Launch to Legacy: Tracking NASA’s Spacecraft Lifecycles

In [4]:
import requests
import pandas as pd
import sqlite3

In [5]:
# Importing CSV into Dataframe
space_mission_df = pd.read_csv('../tin/Resources/space_missions.csv', encoding='latin1')
space_mission_df.columns = space_mission_df.columns.str.lower()
space_mission_df.head()

,company,location,date,time,rocket,mission,rocketstatus,price,missionstatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,NaN,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,NaN,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,NaN,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,NaN,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,NaN,Failure

In [6]:
# Dropping Price Column
space_mission_df = space_mission_df.drop('price', axis='columns')
space_mission_df.head()

,company,location,date,time,rocket,mission,rocketstatus,missionstatus
0,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-10-04,19:28:00,Sputnik 8K71PS,Sputnik-1,Retired,Success
1,RVSN USSR,"Site 1/5, Baikonur Cosmodrome, Kazakhstan",1957-11-03,02:30:00,Sputnik 8K71PS,Sputnik-2,Retired,Success
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,Failure
3,AMBA,"LC-26A, Cape Canaveral AFS, Florida, USA",1958-02-01,03:48:00,Juno I,Explorer 1,Retired,Success
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,Failure

In [7]:
# Data import into SQLite
conn = sqlite3.connect('space_missions.db')
space_mission_df.to_sql('missions', conn, if_exists='replace')

4630

In [8]:
# Identifying all Companies in table

conn = sqlite3.connect('space_missions.db')
cursor = conn.cursor()

cursor.execute("SELECT DISTINCT company FROM missions")
unique_companies = cursor.fetchall()
print("Unique Companies:")
for company in unique_companies:
    print(company[0])
print(f"Total Companies: {len(unique_companies)}")

Unique Companies:
RVSN USSR
US Navy
AMBA
US Air Force
NASA
General Dynamics
Martin Marietta
Armée de l'Air
UT
ASI
OKB-586
CECLES
Yuzhmash
CASC
CNES
Roscosmos
ISAS
RAE
MHI
ISRO
ESA
Arianespace
IAI
Boeing
Douglas
Northrop
Lockheed
VKS RF
MITT
ILS
EER
AEB
SRC
KCST
Sea Launch
Kosmotras
Eurockot
CASIC
Starsem
SpaceX
ULA
Land Launch
ISA
KARI
JAXA
Khrunichev
Blue Origin
Sandia
ExPace
Rocket Lab
Exos
Landspace
OneSpace
i-Space
IRGC
Virgin Orbit
Astra
Galactic Energy
Virgin Galactic
GK LS
Firefly
CAS Space
Total Companies: 62

In [9]:
# NASA Only
cursor.execute("SELECT * FROM missions WHERE company = 'NASA'")
nasa_only = cursor.fetchall()

nasa_df = pd.DataFrame(nasa_only, columns=[desc[0] for desc in cursor.description])
nasa_df = nasa_df.drop('index', axis='columns')
nasa_df

,company,location,date,time,rocket,mission,rocketstatus,missionstatus
0,NASA,"SLC-17A, Cape Canaveral AFS, Florida, USA",1958-10-11,08:42:00,Thor-DM 18 Able I,Pioneer 1,Retired,Partial Failure
1,NASA,"SLC-17A, Cape Canaveral AFS, Florida, USA",1958-11-08,07:30:00,Thor-DM 18 Able I,Pioneer 2,Retired,Failure
2,NASA,"LC-14, Cape Canaveral AFS, Florida, USA",1959-09-09,08:19:00,Atlas-D Mercury,Big Joe 1,Retired,Partial Failure
3,NASA,"LC-14, Cape Canaveral AFS, Florida, USA",1960-07-29,13:13:00,Atlas-D Mercury,Mercury-Atlas 1 (MA-1),Retired,Failure
4,NASA,"LC-5, Cape Canaveral AFS, Florida, USA",1960-11-21,14:00:00,Mercury-Redstone,Mercury-Redstone 1 (MR-1),Retired,Failure
...,...,...,...,...,...,...,...,...
198,NASA,"LC-39A, Kennedy Space Center, Florida, USA",2010-04-05,10:21:00,Space Shuttle Discovery,STS-131,Retired,Success
199,NASA,"LC-39A, Kennedy Space Center, Florida, USA",2010-05-14,18:20:00,Space Shuttle Atlantis,STS-132,Retired,Success
200,NASA,"LC-39A, Kennedy Space Center, Florida, USA",2011-02-24,21:53:00,Space Shuttle Discovery,STS-133,Retired,Success
201,NASA,"LC-39A, Kennedy Space Center, Florida, USA",2011-05-16,12:56:00,Space Shuttle Endeavour,STS-134,Retired,Success
202,NASA,"LC-39A, Kennedy Space Center, Florida, USA",2011-07-08,15:29:00,Space Shuttle Atlantis,STS-135,Retired,Success

In [10]:
# US Govt and Private Sector
us_companies = [
    "NASA", "US Navy", "US Air Force", "SpaceX", "Blue Origin", "Boeing",
    "Northrop", "Lockheed", "ULA", "General Dynamics", "Martin Marietta"
]

query = f"SELECT * FROM missions WHERE company IN ({','.join(['?']*len(us_companies))})"
cursor.execute(query, us_companies)
us_only = cursor.fetchall()

usa_df = pd.DataFrame(us_only, columns=[desc[0] for desc in cursor.description])
usa_df = usa_df.drop('index', axis='columns')
usa_df

,company,location,date,time,rocket,mission,rocketstatus,missionstatus
0,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1957-12-06,16:44:00,Vanguard,Vanguard TV3,Retired,Failure
1,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-02-05,07:33:00,Vanguard,Vanguard TV3BU,Retired,Failure
2,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-03-17,12:15:00,Vanguard,Vanguard 1,Retired,Success
3,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-04-28,02:53:00,Vanguard,Vanguard TV5,Retired,Failure
4,US Navy,"LC-18A, Cape Canaveral AFS, Florida, USA",1958-05-28,03:46:00,Vanguard,Vanguard SLV-1,Retired,Failure
...,...,...,...,...,...,...,...,...
1399,SpaceX,"SLC-4E, Vandenberg SFB, California, USA",2022-07-11,01:39:00,Falcon 9 Block 5,Starlink Group 3-1,Active,Success
1400,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA",2022-07-15,00:44:00,Falcon 9 Block 5,CRS SpX-25,Active,Success
1401,SpaceX,"SLC-40, Cape Canaveral SFS, Florida, USA",2022-07-17,14:20:00,Falcon 9 Block 5,Starlink Group 4-22,Active,Success
1402,SpaceX,"SLC-4E, Vandenberg SFB, California, USA",2022-07-22,17:39:00,Falcon 9 Block 5,Starlink Group 3-2,Active,Success
1403,SpaceX,"LC-39A, Kennedy Space Center, Florida, USA",2022-07-24,13:38:00,Falcon 9 Block 5,Starlink Group 4-25,Active,Success

In [11]:
# Identifying Unique NASA Spacecraft
nasa_unique_rockets = nasa_df['rocket'].unique()
nasa_unique_rockets

array(['Thor-DM 18 Able I', 'Atlas-D Mercury', 'Mercury-Redstone',
       'Scout X-1', 'Blue Scout II', 'Scout X-2', 'Scout X-3',
       'Scout X-4', 'Saturn I', 'Titan II GLV', 'Saturn IB', 'Saturn V',
       'Space Shuttle Columbia', 'Space Shuttle Challenger',
       'Space Shuttle Discovery', 'Space Shuttle Atlantis',
       'Space Shuttle Endeavour', 'Ares 1-X'], dtype=object)

In [17]:
# Calculating Operational Days of Rockets
from datetime import datetime

# Converting date column to datetime format
nasa_df['date'] = pd.to_datetime(nasa_df['date'])

rocket_lifetimes = nasa_df.groupby('rocket').agg(
    First_Mission = ('date', 'min'),
    Last_Mission = ('date', 'max')
).reset_index()

# Calculate days in operation
rocket_lifetimes["Operation_Days"] = (rocket_lifetimes["Last_Mission"] - rocket_lifetimes["First_Mission"]).dt.days
rocket_lifetimes

                      rocket First_Mission Last_Mission  Operation_Days
0                   Ares 1-X    2009-10-28   2009-10-28               0
1            Atlas-D Mercury    1959-09-09   1963-05-15            1344
2              Blue Scout II    1961-11-01   1961-11-01               0
3           Mercury-Redstone    1960-11-21   1961-07-21             242
4                   Saturn I    1964-01-29   1965-07-30             548
5                  Saturn IB    1966-02-26   1975-07-15            3426
6                   Saturn V    1967-11-09   1973-05-14            2013
7                  Scout X-1    1960-12-04   1961-08-25             264
8                  Scout X-2    1962-04-26   1962-04-26               0
9                  Scout X-3    1962-12-16   1962-12-16               0
10                 Scout X-4    1963-12-19   1963-12-19               0
11    Space Shuttle Atlantis    1985-10-03   2011-07-08            9409
12  Space Shuttle Challenger    1983-04-04   1986-01-28            1030
13    Space Shuttle Columbia    1981-04-12   2003-01-16            7949
14   Space Shuttle Discovery    1984-08-30   2011-02-24            9674
15   Space Shuttle Endeavour    1992-05-07   2011-05-16            6948
16         Thor-DM 18 Able I    1958-10-11   1958-11-08              28
17              Titan II GLV    1964-04-08   1966-11-11             947